bogdanm/eLuaBrain/src/platform/stm32/platform.c
  if( d->running == 1 )
    adc_update_dev_sequence( 0 );
  
  if ( d->clocked == 0 && d->running == 1 )
    ADC_SoftwareStartConvCmd( adc[ d->seq_id ], ENABLE );
}

static void adcs_init()
{
  unsigned id;
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  for( id = 0; id < NUM_ADC; id ++ )
    adc_init_ch_state( id );
	
  RCC_APB2PeriphClockCmd( RCC_APB2Periph_ADC1, ENABLE );
  RCC_ADCCLKConfig( RCC_PCLK2_Div8 );
  
  ADC_DeInit( adc[ d->seq_id ] );
  ADC_StructInit( &adc_init_struct );
  
  // Universal Converter Setup
  adc_init_struct.ADC_Mode = ADC_Mode_Independent;
  adc_init_struct.ADC_ScanConvMode = ENABLE;
  adc_init_struct.ADC_ContinuousConvMode = DISABLE;
  adc_init_struct.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  adc_init_struct.ADC_DataAlign = ADC_DataAlign_Right;
  adc_init_struct.ADC_NbrOfChannel = 1;
  
  // Apply default config
  ADC_Init( adc[ d->seq_id ], &adc_init_struct );
  ADC_ExternalTrigConvCmd( adc[ d->seq_id ], DISABLE );
    
  // Enable ADC
  ADC_Cmd( adc[ d->seq_id ], ENABLE );  
  
  // Reset/Perform ADC Calibration
  ADC_ResetCalibration( adc[ d->seq_id ] );
  while( ADC_GetResetCalibrationStatus( adc[ d->seq_id ] ) );
  ADC_StartCalibration( adc[ d->seq_id ] );
  while( ADC_GetCalibrationStatus( adc[ d->seq_id ] ) );
  
  // Set up DMA to handle samples
  RCC_AHBPeriphClockCmd( RCC_AHBPeriph_DMA1, ENABLE );
  
  DMA_DeInit( DMA1_Channel1 );
  dma_init_struct.DMA_PeripheralBaseAddr = ADC1_DR_Address;
  dma_init_struct.DMA_MemoryBaseAddr = (u32)d->sample_buf;
  dma_init_struct.DMA_DIR = DMA_DIR_PeripheralSRC;
  dma_init_struct.DMA_BufferSize = 1;
  dma_init_struct.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  dma_init_struct.DMA_MemoryInc = DMA_MemoryInc_Enable;
  dma_init_struct.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  dma_init_struct.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
  dma_init_struct.DMA_Mode = DMA_Mode_Circular;
  dma_init_struct.DMA_Priority = DMA_Priority_Low;
  dma_init_struct.DMA_M2M = DMA_M2M_Disable;
  DMA_Init( DMA1_Channel1, &dma_init_struct );
  
  ADC_DMACmd(ADC1, ENABLE );
  
  DMA_Cmd( DMA1_Channel1, ENABLE );
  DMA_ITConfig( DMA1_Channel1, DMA1_IT_TC1 , ENABLE ); 
  
  platform_adc_setclock( 0, 0 );
}

u32 platform_adc_setclock( unsigned id, u32 frequency )
{
  TIM_TimeBaseInitTypeDef timer_base_struct;
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  unsigned period, prescaler;
  
  // Make sure sequencer is disabled before making changes
  ADC_ExternalTrigConvCmd( adc[ d->seq_id ], DISABLE );
  
  if ( frequency > 0 )
  {
    d->clocked = 1;
    // Attach timer to converter
    adc_init_struct.ADC_ExternalTrigConv = adc_timer[ d->timer_id ];
    
    period = TIM_GET_BASE_CLK( id ) / frequency;
    
    prescaler = (period / 0x10000) + 1;
  	period /= prescaler;

  	timer_base_struct.TIM_Period = period - 1;
  	timer_base_struct.TIM_Prescaler = prescaler - 1;
  	timer_base_struct.TIM_ClockDivision = TIM_CKD_DIV1;
  	timer_base_struct.TIM_CounterMode = TIM_CounterMode_Down;
  	TIM_TimeBaseInit( timer[ d->timer_id ], &timer_base_struct );
    
    frequency = ( TIM_GET_BASE_CLK( id ) / ( TIM_GetPrescaler( timer[ d->timer_id ] ) + 1 ) ) / period;
    
    // Set up output compare for timer
    TIM_SelectOutputTrigger(timer[ d->timer_id ], TIM_TRGOSource_Update);
  }
  else
  {
    d->clocked = 0;
    
    // Switch to Software-only Trigger
    adc_init_struct.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;   
  }
  
  // Apply config
  ADC_Init( adc[ d->seq_id ], &adc_init_struct );
  
  return frequency;
}

int platform_adc_start_sequence( )
{ 
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  // Only force update and initiate if we weren't already running
  // changes will get picked up during next interrupt cycle
  if ( d->running != 1 )
  {
    adc_update_dev_sequence( 0 );
    
    d->running = 1;
    
    DMA_ClearITPendingBit( DMA1_IT_TC1 );

    nvic_init_structure_adc.NVIC_IRQChannelCmd = ENABLE; 
    NVIC_Init(&nvic_init_structure_adc);

    if( d->clocked == 1 )
      ADC_ExternalTrigConvCmd( adc[ d->seq_id ], ENABLE );
    else
      ADC_SoftwareStartConvCmd( adc[ d->seq_id ], ENABLE );
  }

  return PLATFORM_OK;
}

#endif // ifdef BUILD_ADC

// *****************************************************************************
// VRAM subsystem

#define SPI_ID                1
#define SPI2_DR_Address       0x4000380C

#define CS_PORT               1
#define CS_LINE               12
#define REQ_PORT              0
#define REQ_LINE              1
#define CMD_WRITE             2

#define TIME_PORT             2
#define TIME_PIN              5

static DMA_InitTypeDef DMA_InitStructure;
static GPIO_InitTypeDef GPIO_InitStructure;
extern u32 vram_data[ VRAM_SIZE_TOTAL >> 2 ]; 

void EXTI1_IRQHandler()
{    
  EXTI_ClearFlag( EXTI_Line1 );
  
  // Set pins to SPI
  GPIO_InitStructure.GPIO_Pin = spi_gpio_pins[ SPI_ID ];
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(spi_gpio_port[ SPI_ID ], &GPIO_InitStructure);
  
  // Send data 
  platform_pio_op( TIME_PORT, 1 << TIME_PIN, PLATFORM_IO_PIN_SET );  
  platform_pio_op( CS_PORT, 1 << CS_LINE, PLATFORM_IO_PIN_CLEAR );
  platform_pio_op( CS_PORT, 1 << CS_LINE, PLATFORM_IO_PIN_DIR_OUTPUT );
  // Send write command
  platform_spi_send_recv( SPI_ID, CMD_WRITE );
  platform_spi_send_recv( SPI_ID, 0 );
  platform_spi_send_recv( SPI_ID, 0 );    
  // And DMA everything else
  DMA_DeInit( DMA1_Channel5 );
  DMA_Init( DMA1_Channel5, &DMA_InitStructure );
  DMA_ITConfig( DMA1_Channel5, DMA_IT_TC, ENABLE );  
	SPI_I2S_DMACmd( SPI2, SPI_I2S_DMAReq_Tx, ENABLE );	
	DMA_Cmd( DMA1_Channel5, ENABLE );  	
  // End tranfer will generate a DMA1_Channel5 interrupt (below)
}

void DMA1_Channel5_IRQHandler()
{
  DMA_ClearITPendingBit( DMA1_IT_GL5 );
  platform_pio_op( CS_PORT, 1 << CS_LINE, PLATFORM_IO_PIN_SET );  
  platform_pio_op( CS_PORT, 1 << CS_LINE, PLATFORM_IO_PIN_DIR_INPUT ); 
  platform_pio_op( TIME_PORT, 1 << TIME_PIN, PLATFORM_IO_PIN_CLEAR );    
    
